# Bil395_HW2

RUST dosyasını çalıştırmak için
    $ cargo build
    $ cargo run
    > 3 + 4
    = 7
    > (9+2) * 2    
    = 22
    > exit
    şeklinde çalıştırılabilir


ADA dosyasını çalıştırmak için
    $ gnatmake calculator_ada.adb
    $ ./calculator_ada

    Simple Ada Calculator
    Enter expressions. Type 'quit' to exit.
    > 3 + 5
    Result: 8.000000
    > (9+2) * 2
    Result: 22.000000
    > quit

    şeklinde çalıştırılabilir

PERL dosyasını çalıştırmak için
    $ perl calculator.pl

    > 3 + 4
    = 7
    > (5+5)*3
    = 30
    > exit

    şeklinde çalıştırılabilir

SCHEME dosyasını çallıştırmak için
    $ racket calculator_scheme.scm

    > (+ 3 4)
    = 7
    > (set x 10)
    = 10
    > (+ x 5)
    = 15
    > exit

    şeklinde çalıştırılabilir

PROLOG dosyasını çalıştırmak için
    $ swipl calculator_prolog.pro

    > 3 + 4.
    Result: 7
    > 10 / 2.
    Result: 5
    > (5-2) * 4.
    Result: 12

    şeklinde çalıştırılabilir